Repository: yiguang20/Panic-Saver
Catalog: lib/presentation/l10n/app_*.arb
Languages: de, es, fr, zh

# appTitle
source: Panic Relief
de: Panik-Linderung
es: Alivio del Pánico
fr: Soulagement de la Panique
zh: 惊恐缓解

# langToggle
source: 中文
de: 中文 / EN
es: 中文 / EN
fr: 中文 / EN
zh: EN

# navCrisis
source: CRISIS
de: KRISE
fr: CRISE
zh: 危机应对

# navPractice
source: PRACTICE
de: ÜBUNG
es: PRÁCTICA
fr: PRATIQUE
zh: 日常练习

# hintDoubleTap
source: Double tap screen for Help Letter
de: Tippen Sie zweimal auf den Bildschirm für den Hilfebrief
es: Toca dos veces la pantalla para ver la Carta de Ayuda
fr: Appuyez deux fois sur l'écran pour la Lettre d'Aide
zh: 双击屏幕任意处显示求助信

# step1Title
source: Preparation
de: Vorbereitung
es: Preparación
fr: Préparation
zh: 准备

# step1Text
source: If possible, put on your headphones. Find a quiet corner. You are entering a safe space.
de: Wenn möglich, setzen Sie Ihre Kopfhörer auf. Finden Sie eine ruhige Ecke. Sie betreten einen sicheren Raum.
es: Si es posible, ponte los auriculares. Encuentra un rincón tranquilo. Estás entrando en un espacio seguro.
fr: Si possible, mettez vos écouteurs. Trouvez un coin tranquille. Vous entrez dans un espace sûr.
zh: 如果可以，请戴上耳机。或者找一个相对安静的角落。这里只有你和当下。

# step1Sub
source: Create a physical barrier.
de: Schaffen Sie eine physische Barriere.
es: Crea una barrera física.
fr: Créez une barrière physique.
zh: 建立物理屏障，创造安全感。

# step1Btn
source: I'm ready
de: Ich bin bereit
es: Estoy listo
fr: Je suis prêt
zh: 准备好了

# step2Title
source: Stop & Pause
de: Stoppen und Pausieren
es: Detente y Pausa
fr: Arrêtez et Pausez
zh: 立刻停下

# step2Text
source: Stop whatever you are doing. Sit down. Feel the chair supporting you. You are safe.
de: Hören Sie auf, was Sie gerade tun. Setzen Sie sich hin. Spüren Sie, wie der Stuhl Sie stützt. Sie sind sicher.
es: Deja de hacer lo que estás haciendo. Siéntate. Siente la silla que te sostiene. Estás a salvo.
fr: Arrêtez ce que vous faites. Asseyez-vous. Sentez la chaise qui vous soutient. Vous êtes en sécurité.
zh: 停下你手里的动作。坐下来。你是安全的。这种感觉很强烈，但它没有危险。

# step2Sub
source: "I am uncomfortable, but I am not in danger."
de: "Mir ist unwohl, aber ich bin nicht in Gefahr."
es: "Estoy incómodo, pero no estoy en peligro."
fr: "Je suis mal à l'aise, mais je ne suis pas en danger."
zh: "这只是身体的误报。"

# step2Btn
source: I've paused
de: Ich habe pausiert
es: He pausado
fr: J'ai fait une pause
zh: 暂停中

# step3Title
source: Breathe with Me
de: Atmen Sie mit Mir
es: Respira Conmigo
fr: Respirez avec Moi
zh: 跟随呼吸

# step3Text
source: Focus on the circle. Inhale as it expands. Exhale as it shrinks. Let your belly rise.
de: Konzentrieren Sie sich auf den Kreis. Atmen Sie ein, während er sich ausdehnt. Atmen Sie aus, während er sich zusammenzieht. Lassen Sie Ihren Bauch sich heben.
es: Concéntrate en el círculo. Inhala mientras se expande. Exhala mientras se contrae. Deja que tu vientre se eleve.
fr: Concentrez-vous sur le cercle. Inspirez pendant qu'il se dilate. Expirez pendant qu'il se contracte. Laissez votre ventre se soulever.
zh: 看着上方的光球。随着它变大吸气，随着它变小呼气。把气吸到肚子里。

# step3Sub
source: 4-7-8 Rhythm
de: 4-7-8 Rhythmus
es: Ritmo 4-7-8
fr: Rythme 4-7-8
zh: 呼气要比吸气长。

# step3Btn
source: Breathing...
de: Ich atme...
es: Respirando...
fr: Je respire...
zh: 跟随中...

# step4Title
source: Grounding
de: Erdung
es: Anclaje
fr: Ancrage
zh: 着地技术

# step4Text
source: Look around. Find 3 distinct colors. Name them out loud. Bring your mind back to reality.
de: Schauen Sie sich um. Finden Sie 3 verschiedene Farben. Nennen Sie sie laut. Bringen Sie Ihren Geist zurück zur Realität.
es: Mira a tu alrededor. Encuentra 3 colores distintos. Nómbralos en voz alta. Trae tu mente de vuelta a la realidad.
fr: Regardez autour de vous. Trouvez 3 couleurs distinctes. Nommez-les à voix haute. Ramenez votre esprit à la réalité.
zh: 看看周围。找出 3 个蓝色的东西。大声说出它们的名字。感受双脚踩在地面的实感。

# step4Sub
source: You are here, right now.
de: Sie sind hier, genau jetzt.
es: Estás aquí, ahora mismo.
fr: Vous êtes ici, maintenant.
zh: 你就在这里，现实世界很安全。

# step4Btn
source: I see them
de: Ich sehe sie
es: Los veo
fr: Je les vois
zh: 我找到了

# step5Title
source: Truth Talk
de: Wahrheit Sprechen
es: Habla con la Verdad
fr: Parlez Vrai
zh: 自我对话

# step5Text
source: Your heart is racing because of adrenaline. It's a false alarm from your body.
de: Ihr Herz rast wegen Adrenalin. Es ist ein Fehlalarm Ihres Körpers.
es: Tu corazón late rápido por la adrenalina. Es una falsa alarma de tu cuerpo.
fr: Votre cœur bat vite à cause de l'adrénaline. C'est une fausse alarme de votre corps.
zh: 心跳快只是因为肾上腺素。你不会死，也不会发疯。这只是暂时的生理反应。

# step5Sub
source: "This feeling will pass in minutes."
de: "Dieses Gefühl wird in Minuten vergehen."
es: "Esta sensación pasará en minutos."
fr: "Cette sensation passera en quelques minutes."
zh: "我以前经历过，每次都平安度过了。"

# step5Btn
source: I understand
de: Ich verstehe
es: Entiendo
fr: Je comprends
zh: 我相信

# step6Title
source: Floating
de: Schweben
es: Flotando
fr: Flottement
zh: 漂浮

# step6Text
source: Don't fight the feeling. Imagine you are a feather floating on a wave. Let the wave carry you.
de: Kämpfen Sie nicht gegen das Gefühl. Stellen Sie sich vor, Sie sind eine Feder, die auf einer Welle schwebt. Lassen Sie die Welle Sie tragen.
es: No luches contra la sensación. Imagina que eres una pluma flotando en una ola. Deja que la ola te lleve.
fr: Ne combattez pas la sensation. Imaginez que vous êtes une plume flottant sur une vague. Laissez la vague vous porter.
zh: 不要对抗这种感觉。对抗只会增加焦虑。像羽毛一样漂浮在海浪上，任由它起伏。

# step6Sub
source: Acceptance dissolves the tension.
de: Akzeptanz löst die Spannung.
es: La aceptación disuelve la tensión.
fr: L'acceptation dissout la tension.
zh: 面对，接受，漂浮，等待。

# step6Btn
source: I am floating
de: Ich schwebe
es: Estoy flotando
fr: Je flotte
zh: 正在漂浮

# step7Title
source: Be Gentle
de: Seien Sie Sanft
es: Sé Amable
fr: Soyez Doux
zh: 自我关怀

# step7Text
source: Don't blame yourself. You are handling this difficult moment with great courage.
de: Geben Sie sich nicht die Schuld. Sie bewältigen diesen schwierigen Moment mit großem Mut.
es: No te culpes. Estás manejando este momento difícil con gran valentía.
fr: Ne vous blâmez pas. Vous gérez ce moment difficile avec beaucoup de courage.
zh: 你做得很好。不要责怪自己。你正在勇敢地面对困难。

# step7Sub
source: "I love and accept myself."
de: "Ich liebe und akzeptiere mich selbst."
es: "Me amo y me acepto."
fr: "Je m'aime et je m'accepte."
zh: 对自己温柔一点。

# step7Btn
source: I am trying
de: Ich versuche es
es: Lo estoy intentando
fr: J'essaie
zh: 感受中

# step8Title
source: Waiting
de: Warten
es: Esperando
fr: Attente
zh: 等待消退

# step8Text
source: The peak is over. Let time pass. Do not rush to feel 'normal' immediately.
de: Der Höhepunkt ist vorbei. Lassen Sie die Zeit vergehen. Beeilen Sie sich nicht, sich sofort 'normal' zu fühlen.
es: El pico ha pasado. Deja que pase el tiempo. No te apresures a sentirte 'normal' inmediatamente.
fr: Le pic est passé. Laissez le temps passer. Ne vous précipitez pas pour vous sentir 'normal' immédiatement.
zh: 风暴正在减弱。给自己一点时间。不要急着立刻好起来。

# step8Sub
source: Patience is key.
de: Geduld ist der Schlüssel.
es: La paciencia es clave.
fr: La patience est la clé.
zh: 让时间治愈一切。

# step8Btn
source: Waiting...
de: Ich warte...
es: Esperando...
fr: J'attends...
zh: 等待中...

# step9Title
source: Return
de: Rückkehr
es: Regreso
fr: Retour
zh: 回归

# step9Text
source: You have ridden the wave. You are strong. Take a sip of water when you are ready.
de: Sie haben die Welle überstanden. Sie sind stark. Trinken Sie einen Schluck Wasser, wenn Sie bereit sind.
es: Has superado la ola. Eres fuerte. Toma un sorbo de agua cuando estés listo.
fr: Vous avez surmonté la vague. Vous êtes fort. Prenez une gorgée d'eau quand vous êtes prêt.
zh: 你战胜了这次海浪。你很坚强。喝口水，准备好后再回到生活中。

# step9Sub
source: Welcome back.
de: Willkommen zurück.
es: Bienvenido de vuelta.
fr: Bon retour.
zh: 欢迎回来。

# step9Btn
source: Start Over
de: Neu Starten
es: Empezar de Nuevo
fr: Recommencer
zh: 重新开始

# helpHeading
source: I Need Help
de: Ich Brauche Hilfe
es: Necesito Ayuda
fr: J'ai Besoin d'Aide
zh: 我需要帮助

# helpSubheading
source: PLEASE READ THIS
de: BITTE LESEN SIE DIES
es: POR FAVOR LEE ESTO
fr: VEUILLEZ LIRE CECI
zh: 请阅读这段话

# helpP1
source: I am having a Panic Attack. I cannot speak clearly right now.
de: Ich habe eine Panikattacke. Ich kann gerade nicht klar sprechen.
es: Estoy teniendo un Ataque de Pánico. No puedo hablar claramente ahora.
fr: Je fais une Crise de Panique. Je ne peux pas parler clairement maintenant.
zh: 我正在经历惊恐发作（焦虑症）。我现在很难说话。

# helpP2
source: I am NOT dying.
de: Ich sterbe NICHT.
es: NO me estoy muriendo.
fr: Je ne suis PAS en train de mourir.
zh: 我没有生命危险。

# helpP3
source: I am NOT dangerous.
de: Ich bin NICHT gefährlich.
es: NO soy peligroso.
fr: Je ne suis PAS dangereux.
zh: 我不会伤害任何人。

# helpP4
source: Please do not call an ambulance unless I ask.
de: Bitte rufen Sie keinen Krankenwagen, es sei denn, ich bitte darum.
es: Por favor, no llames a una ambulancia a menos que yo lo pida.
fr: S'il vous plaît, n'appelez pas d'ambulance sauf si je le demande.
zh: 除非我主动要求，请不要叫救护车。

# helpP5
source: Please just sit with me calmly until my breathing slows down. Thank you.
de: Bitte setzen Sie sich einfach ruhig zu mir, bis sich meine Atmung verlangsamt. Danke.
es: Por favor, solo siéntate conmigo tranquilamente hasta que mi respiración se calme. Gracias.
fr: S'il vous plaît, restez simplement assis avec moi calmement jusqu'à ce que ma respiration ralentisse. Merci.
zh: 请只是陪我安静地坐一会儿，直到我的呼吸平稳。谢谢您的善良。

# helpBack
source: Back to Guide
de: Zurück zum Leitfaden
es: Volver a la Guía
fr: Retour au Guide
zh: 返回引导

# pracTitle
source: Daily Practice
de: Tägliche Übung
es: Práctica Diaria
fr: Pratique Quotidienne
zh: 日常练习

# pracSub
source: Build resilience before the storm.
de: Bauen Sie Widerstandsfähigkeit vor dem Sturm auf.
es: Construye resiliencia antes de la tormenta.
fr: Construisez la résilience avant la tempête.
zh: 在风暴来临前建立心理防线

# prac1Title
source: Deep Breath
de: Tiefes Atmen
es: Respiración Profunda
fr: Respiration Profonde
zh: 深呼吸

# prac1Desc
source: Abdominal breathing
de: Bauchatmung (Kap.4)
es: Respiración abdominal (Cap.4)
fr: Respiration abdominale
zh: 腹式呼吸法

# prac2Title
source: Movement
de: Bewegung
es: Movimiento
fr: Mouvement
zh: 运动释放

# prac2Desc
source: Release energy
de: Energie freisetzen (Kap.5)
es: Libera energía (Cap.5)
fr: Libérer l'énergie
zh: 消耗多余能量

# prac3Title
source: Self Talk
de: Selbstgespräch
es: Diálogo Interno
fr: Dialogue Intérieur
zh: 自我对话

# prac3Desc
source: Positive logic
de: Positive Logik (Kap.8)
es: Lógica positiva (Cap.8)
fr: Logique positive
zh: 改变灾难化思维

# prac4Title
source: Acceptance
de: Akzeptanz
es: Aceptación
fr: Acceptation
zh: 接纳漂浮

# prac4Desc
source: Floating technique
de: Schwebetechnik (Kap.6)
es: Técnica de flotación (Cap.6)
fr: Technique de flottement
zh: 威克斯漂浮法

# settingsTitle
source: Settings
zh: 设置

# breathingSettingsTitle
source: Breathing Settings
zh: 呼吸设置

# themeSettingsTitle
source: Theme Settings
zh: 主题设置

# presetBeginner
source: Beginner (3-5-6)
zh: 初学者 (3-5-6)

# presetStandard
source: Standard (4-7-8)
zh: 标准 (4-7-8)

# presetAdvanced
source: Advanced (5-8-10)
zh: 进阶 (5-8-10)

# customBreathingButton
source: Record Custom Rhythm
zh: 自定义节奏

source: Current Breathing Rhythm
zh: 当前呼吸节奏

source: Inhale
zh: 吸气

source: Hold
zh: 屏息

source: Exhale
zh: 呼气

source: seconds
zh: 秒

source: Total Cycle
zh: 总周期

# themeComingSoon
source: Theme colors and content editing features
zh: 主题颜色和内容编辑功能

source: Coming soon...
zh: 即将推出...

# resetButton
source: Reset to Defaults
zh: 恢复默认设置

# resetDialogTitle
source: Reset Settings
zh: 重置设置

# resetDialogContent
source: Are you sure you want to reset all settings to default values?
zh: 确定要将所有设置恢复为默认值吗？

source: Cancel
zh: 取消

source: Confirm
zh: 确定

# breathingRecorderTitle
source: Custom Breathing Rhythm
zh: 自定义呼吸节奏

source: Record Your Rhythm
zh: 录制你的呼吸节奏

source: Recorded Cycles
zh: 已录制的周期

source: Cycle
zh: 周期

source: Use This Rhythm
zh: 使用这个节奏

# continueRecording
source: Continue recording cycle
zh: 继续录制第

# instructionWaiting
source: Hold the circle to start inhaling Release to hold breath Hold again to exhale Repeat 3 times
zh: 按住圆圈开始吸气 松开进入屏息 再按住开始呼气 重复3次

# instructionInhaling
source: Inhaling... Release to hold breath
zh: 正在吸气... 松开手指进入屏息

# instructionHoldingAfterInhale
source: Holding breath... Hold to start exhaling
zh: 屏息中... 按住开始呼气

# instructionExhaling
source: Exhaling... Release to complete cycle
zh: 正在呼气... 松开手指完成一个周期

# instructionHoldingAfterExhale
source: Holding breath... Hold to start next cycle
zh: 屏息中... 按住开始下一个周期

# phaseHold
source: Hold
zh: 按住

# phaseInhale
source: Inhale
zh: 吸气

# phaseExhale
source: Exhale
zh: 呼气

source: Practice Your Rhythm
zh: 实践你的节奏

source: Enter Custom Rhythm
zh: 输入自定义节奏

source: Inhale (seconds)
zh: 吸气（秒）

source: Hold (seconds)
zh: 屏息（秒）

source: Exhale (seconds)
zh: 呼气（秒）

source: Start Practice
zh: 开始实践

# saveAsCustom
source: Save as Custom Rhythm
zh: 保存为自定义节奏

# practiceInstructions
source: Practice this rhythm and adjust until you find what feels comfortable
zh: 实践这个节奏并调整，直到找到舒适的感觉

# rhythmSaved
source: Rhythm saved successfully!
zh: 节奏保存成功！

# invalidInput
source: Please enter valid numbers greater than 0
zh: 请输入大于0的有效数字
